InformationRegisters/ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЭлементКонструктора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКонструктораВидовПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЗначениеЭлементаКонструктораВидовПродукцииИС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС/Forms/НастройкаДоступныхЗначений/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ДанныеВыделеннойОбласти;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементКонструктора = Параметры.ЭлементКонструктора;
	Если ЗначениеЗаполнено(ЭлементКонструктора) Тогда
		ЭтотОбъект.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
	КонецЕсли;
	
	ЦветФонаИзмененногоЗначения = ЦветаСтиля.ЦветФонаИзмененногоЗначенияГосИС;
	
	ИнициализироватьНастройкиОтбора();
	
	Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Истина;
	Элементы.ТабличныйДокумент.ОтображениеСостояния.Текст = НСтр(
		"ru = 'Для начала работы установите нужный отбор и нажмите ""Заполнить""'");
	
	ОбщегоНазначенияСобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ЭлементКонструктора) Тогда
		ЭлементыОтбора = НастройкиОтбора.Настройки.Отбор.Элементы;
		ЭлементыОтбора.Очистить();
		ЭлементОтбора = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЭлементКонструктора");
		ЭлементОтбора.ПравоеЗначение = ЭлементКонструктора;
		ВыполнитьЗаполнениеДанных();
	Иначе
		УстановитьДоступностьЗаписиДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если ИзмененныеДанные.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ВопросЗаписатьДанныеПередЗакрытием", ЭтотОбъект),
			НСтр("ru = 'В таблице присутствуют измененные данные. При закрытии формы изменения будут утеряны.
				|Выполнить запись измененных данных перед закрытием формы?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкиОтбораНастройкиОтборПриИзменении(Элемент)
	
	Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Истина;
	Элементы.ТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.ТабличныйДокумент.ОтображениеСостояния.Текст = НСтр(
		"ru = 'Изменился отбор. Нажмите ""Заполнить""'");;
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументПриАктивизации(Элемент)
	
	ПодключитьОбработчикОжидания("ВыделитьТекущуюОбласть", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументВыбор(Элемент, Область, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбработатьВыделеннуюОбласть(Область);
	УстановитьДоступностьЗаписиДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныйДокументОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ИзмененныеДанные.Количество() = 0 Тогда
		ВыполнитьЗаполнениеДанных();
	Иначе
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ВопросЗаписатьДанныеПередЗаполнением", ЭтотОбъект),
			НСтр("ru = 'В таблице присутствуют измененные данные. При заполнении изменения будут утеряны.
				|Выполнить запись измененных данных перед заполнением?'"),
			РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	
	ВыполнитьЗаписьДанных();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочие

&НаКлиенте
Процедура ВопросЗаписатьДанныеПередЗаполнением(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаписьДанных();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ВыполнитьЗаполнениеДанных();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаписатьДанныеПередЗакрытием(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьЗаписьДанных(Ложь);
		ИзмененныеДанные.Очистить();
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ИзмененныеДанные.Очистить();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеДанных()
	
	ОчиститьСообщения();
	ВыполнитьЗаполнениеДанныхНаСервере();
	УстановитьДоступностьЗаписиДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаписьДанных(ВыполнятьЗаполнение = Истина)
	
	ОчиститьСообщения();
	ВыполнитьЗаписьДанныхНаСервере(ВыполнятьЗаполнение);
	УстановитьДоступностьЗаписиДанных();
	Оповестить("ИзменениеДанныхКонструктораВидовПродукцииИС",, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЗаписиДанных()
	
	Элементы.ФормаЗаписать.Доступность = ИзмененныеДанные.Количество() > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьТекущуюОбласть()
	
	Если Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость Тогда
		ДанныеВыделеннойОбласти = Неопределено;
		Возврат;
	КонецЕсли;
	
	ОбщегоНазначенияИСКлиент.ВыделитьТекущуюОбласть(ТабличныйДокумент, ДанныеВыделеннойОбласти);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыделеннуюОбласть(ВыделеннаяОбласть, НовоеЗначение = Неопределено)
	
	ЕстьДанныеДляОбработки = Ложь;
	ДанныеДляРасшифровки = Новый Массив;
	
	Для НомерСтроки = ВыделеннаяОбласть.Верх По ВыделеннаяОбласть.Низ Цикл
		Для НомерКолонки = ВыделеннаяОбласть.Лево По ВыделеннаяОбласть.Право Цикл
			Область = ТабличныйДокумент.Область(НомерСтроки, НомерКолонки);
			Если ТипЗнч(Область.Расшифровка) <> Тип("ИдентификаторРасшифровкиКомпоновкиДанных") Тогда
				Продолжить;
			КонецЕсли;
			КлючЭлементаДанных = Область.Расшифровка;
			ЭлементДанных = Данные.Получить(КлючЭлементаДанных);
			Если ЭлементДанных = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если Не ЭлементДанных.Свойство("ТекущееЗначение") Тогда
				Для Каждого КлючИЗначение Из ЭлементДанных Цикл
					Если ДанныеДляРасшифровки.Найти(КлючИЗначение.Значение) = Неопределено Тогда
						ДанныеДляРасшифровки.Добавить(КлючИЗначение.Значение);
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли НовоеЗначение = Неопределено Тогда
				ЕстьДанныеДляОбработки = Истина;
				Если Не ЭлементДанных.ТекущееЗначение Тогда
					ОбработатьВыделеннуюОбласть(ВыделеннаяОбласть, Истина);
					Возврат;
				КонецЕсли;
			Иначе
				ЭлементИзмененныхДанных = ИзмененныеДанные.НайтиПоЗначению(КлючЭлементаДанных);
				ЭлементДанных.ТекущееЗначение = НовоеЗначение;
				Если ЭлементДанных.ТекущееЗначение Тогда
					Область.Картинка = БиблиотекаКартинок.УспешнаяПроверкаНаличияГосИС;
				Иначе
					Область.Картинка = Неопределено;
				КонецЕсли;
				Если ЭлементДанных.Значение = ЭлементДанных.ТекущееЗначение Тогда
					Область.ЦветФона = Новый Цвет;
					Если ЭлементИзмененныхДанных <> Неопределено Тогда
						ИзмененныеДанные.Удалить(ЭлементИзмененныхДанных);
					КонецЕсли;
				Иначе
					Область.ЦветФона = ЦветФонаИзмененногоЗначения;
					Если ЭлементИзмененныхДанных = Неопределено Тогда
						ИзмененныеДанные.Добавить(КлючЭлементаДанных);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЕстьДанныеДляОбработки Тогда
		ОбработатьВыделеннуюОбласть(ВыделеннаяОбласть, Ложь);
	ИначеЕсли НовоеЗначение = Неопределено
		И ДанныеДляРасшифровки.Количество() = 1 Тогда
		ПоказатьЗначение(, ДанныеДляРасшифровки[0]);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СКД

&НаСервере
Процедура ВыполнитьЗаполнениеДанныхНаСервере()
	
	ВыполнитьЗаполнениеОтбораЭлементовКонструктора();
	
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпоновкиДанных();
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	ДобавитьЭлементыОтбораКомпоновщика(Компоновщик.Настройки.Отбор.Элементы,
		НастройкиОтбора.Настройки.Отбор.Элементы,
		Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.Элементы);
	
	ДоработатьСхемуКомпоновкиДанных(СхемаКомпоновкиДанных);
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(), ДанныеРасшифровки,,
		Тип("ГенераторМакетаКомпоновкиДанных"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет,, ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ТабличныйДокумент = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	СформироватьДанныеИзРасшифровки(ДанныеРасшифровки);
	
	ИзмененныеДанные.Очистить();
	
	Элементы.ТабличныйДокумент.ОтображениеСостояния.Видимость = Ложь;
	Элементы.ТабличныйДокумент.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать;
	
	Модифицированность = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗаполнениеОтбораЭлементовКонструктора()
	
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпоновкиДанныхОтбораЭлементовКонструктора();
	
	Компоновщик = Новый КомпоновщикНастроекКомпоновкиДанных;
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Компоновщик.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	ДобавитьЭлементыОтбораКомпоновщика(Компоновщик.Настройки.Отбор.Элементы,
		НастройкиОтбора.Настройки.Отбор.Элементы,
		Компоновщик.Настройки.Отбор.ДоступныеПоляОтбора.Элементы);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Компоновщик.ПолучитьНастройки(),,,
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(Макет);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаДанных = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ВсеПараметрыЭлементовКонструктора = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПараметрыЭлементовКонструктора();
	
	Результат = Новый Соответствие;
	
	Для Каждого Строка Из ТаблицаДанных Цикл
		ПараметрыЭлементаКонструктора = ВсеПараметрыЭлементовКонструктора[Строка.ЭлементКонструктора];
		Если ПараметрыЭлементаКонструктора <> Неопределено Тогда
			Результат.Вставить(Строка.ЭлементКонструктора, ПараметрыЭлементаКонструктора);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыЭлементовКонструктора = Новый ФиксированноеСоответствие(Результат);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСхемуКомпоновкиДанных()
	
	Возврат РегистрыСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.ПолучитьМакет("МакетНастроекДоступныхЗначений");
	
КонецФункции

&НаСервере
Функция ПолучитьСхемуКомпоновкиДанныхОтбораЭлементовКонструктора()
	
	Возврат РегистрыСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.ПолучитьМакет("МакетОтбораЭлементовКонструктора");
	
КонецФункции

&НаСервере
Процедура ИнициализироватьНастройкиОтбора()
	
	СхемаКомпоновкиДанных = ПолучитьСхемуКомпоновкиДанных();
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, Новый УникальныйИдентификатор);
	
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных);
	
	НастройкиОтбора.Инициализировать(ИсточникНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ДоработатьСхемуКомпоновкиДанных(СхемаКомпоновкиДанных)
	
	ЭлементыПримитивные = Новый Массив;
	ЭлементыСсылочные = Новый Массив;
	ЭлементыСсылочныеТипы = Новый Соответствие;
	
	Для Каждого КлючИЗначение Из ПараметрыЭлементовКонструктора Цикл
		ИмяПредопределенного = Справочники.ЭлементыКонструктораВидовПродукцииИС.ПолучитьИмяПредопределенного(КлючИЗначение.Ключ);
		Если КлючИЗначение.Значение.Параметризуется Тогда
			Для Каждого Тип Из КлючИЗначение.Значение.ТипЗначения.Типы() Цикл
				МетаданныеПоТипу = Метаданные.НайтиПоТипу(Тип);
				Если МетаданныеПоТипу = Неопределено Тогда
					ЭлементыПримитивные.Добавить(
						СтрШаблон("ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.%1)", ИмяПредопределенного));
				Иначе
					ПолноеИмяМетаданных = МетаданныеПоТипу.ПолноеИмя();
					ТекущийЭлементДанных = Новый Структура;
					ТекущийЭлементДанных.Вставить("ИмяПредопределенного", ИмяПредопределенного);
					ТекущийЭлементДанных.Вставить("ПолноеИмяМетаданных",  ПолноеИмяМетаданных);
					ЭлементыСсылочные.Добавить(ТекущийЭлементДанных);
					Если ЭлементыСсылочныеТипы[ТекущийЭлементДанных.ПолноеИмяМетаданных] = Неопределено Тогда
						ТекущийЭлементДанных = Новый Структура;
						ТекущийЭлементДанных.Вставить("Иерархический", 
							Метаданные.Справочники.Содержит(МетаданныеПоТипу)
							И МетаданныеПоТипу.Иерархический);
						ЭлементыСсылочныеТипы.Вставить(ПолноеИмяМетаданных, ТекущийЭлементДанных);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
		
	Если ЭлементыПримитивные.Количество() > 0
		Или ЭлементыСсылочные.Количество() > 0 Тогда
		ЗапросСКД = СхемаКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Запрос;
		СчетчикЗапросов = 0;
		Если ЭлементыПримитивные.Количество() > 0 Тогда
			ТекстЗамены = СтрШаблон(
			"ВЫБРАТЬ
			|	ЭлементыКонструктора.Ссылка КАК ЭлементКонструктора
			|ПОМЕСТИТЬ ЭлементыКонструктораПримитивныхТипов
			|ИЗ
			|	Справочник.ЭлементыКонструктораВидовПродукцииИС КАК ЭлементыКонструктора
			|ГДЕ
			|	ЭлементыКонструктора.Ссылка В (%1)
			|", СтрСоединить(ЭлементыПримитивные, ","));
			ЗаменитьДоработанныйТекстЗапроса(ЗапросСКД, ТекстЗамены, СчетчикЗапросов);
		КонецЕсли;
		СчетчикЗапросов = СчетчикЗапросов + 1;
		Если ЭлементыСсылочные.Количество() > 0 Тогда
			ТекстЗамены = "";
			Для Каждого ТекущийЭлементДанных Из ЭлементыСсылочные Цикл
				ЭтоПервыйЭлемент = ТекстЗамены = "";
				Если Не ЭтоПервыйЭлемент Тогда
					ТекстЗамены = ТекстЗамены + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|";
				КонецЕсли;
				ТекстЗамены = ТекстЗамены + СтрШаблон("
				|ВЫБРАТЬ
				|	ЗНАЧЕНИЕ(Справочник.ЭлементыКонструктораВидовПродукцииИС.%1) КАК ЭлементКонструктора,
				|	ТИП(%2) КАК ТипЭлементаКонструктора",
				ТекущийЭлементДанных.ИмяПредопределенного,
				ТекущийЭлементДанных.ПолноеИмяМетаданных);
				Если ЭтоПервыйЭлемент Тогда
					ТекстЗамены = ТекстЗамены + "
					|ПОМЕСТИТЬ ТипыСсылочныхЭлементовКонструктора";
				КонецЕсли;
			КонецЦикла;
			ЗаменитьДоработанныйТекстЗапроса(ЗапросСКД, ТекстЗамены, СчетчикЗапросов);
		КонецЕсли;
		СчетчикЗапросов = СчетчикЗапросов + 1;
		Если ЭлементыСсылочныеТипы.Количество() > 0 Тогда
			ТекстЗамены = "";
			Для Каждого КлючИЗначение Из ЭлементыСсылочныеТипы Цикл
				ЭтоПервыйЭлемент = ТекстЗамены = "";
				Если Не ЭтоПервыйЭлемент Тогда
					ТекстЗамены = ТекстЗамены + "
					|
					|ОБЪЕДИНИТЬ ВСЕ
					|";
				КонецЕсли;
				ТекстЗамены = ТекстЗамены + СтрШаблон("
				|ВЫБРАТЬ
				|	ТИП(%1) КАК ТипЭлементаКонструктора,
				|	ТаблицаДанных.Ссылка КАК Ссылка",
				КлючИЗначение.Ключ);
				Если ЭтоПервыйЭлемент Тогда
					ТекстЗамены = ТекстЗамены + "
					|ПОМЕСТИТЬ СсылочныеЗначенияЭлементовКонструктораПоТипам";
				КонецЕсли;
				ТекстЗамены = ТекстЗамены + СтрШаблон("
				|ИЗ
				|	%1 КАК ТаблицаДанных",
				КлючИЗначение.Ключ);
				Если КлючИЗначение.Значение.Иерархический Тогда
					ТекстЗамены = ТекстЗамены + "
					|ГДЕ НЕ ТаблицаДанных.ЭтоГруппа";
				КонецЕсли;
			КонецЦикла;
			ЗаменитьДоработанныйТекстЗапроса(ЗапросСКД, ТекстЗамены, СчетчикЗапросов);
		КонецЕсли;
		СхемаКомпоновкиДанных.НаборыДанных.ОсновнойНаборДанных.Запрос = ЗапросСКД;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаменитьДоработанныйТекстЗапроса(ЗапросСКД, ТекстЗамены, СчетчикЗапросов)
	
	Если СчетчикЗапросов = 0 Тогда
		ЗапросСКД = ТекстЗамены + Сред(ЗапросСКД, СтрНайти(ЗапросСКД, ";"));
	Иначе
		ЗапросСКД = Лев(ЗапросСКД, СтрНайти(ЗапросСКД, ";",,, СчетчикЗапросов) + 1) +
			ТекстЗамены +
			Сред(ЗапросСКД, СтрНайти(ЗапросСКД, ";",,, СчетчикЗапросов + 1));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементыОтбораКомпоновщика(ЭлементыПриемника, ЭлементыИсточника, ДоступныеПоляОтбора)
	
	Для Каждого ЭлементИсточника Из ЭлементыИсточника Цикл
		Если ТипЗнч(ЭлементИсточника) = Тип("ЭлементОтбораКомпоновкиДанных")
			И ЭлементИсточника.Использование
			И ДоступныеПоляОтбора.Найти(ЭлементИсточника.ЛевоеЗначение) <> Неопределено Тогда
			ЭлементПриемника = ЭлементыПриемника.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
		ИначеЕсли ТипЗнч(ЭлементИсточника) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
			ЭлементПриемника = ЭлементыПриемника.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(ЭлементПриемника, ЭлементИсточника);
			ДобавитьЭлементыОтбораКомпоновщика(ЭлементПриемника.Элементы, ЭлементИсточника.Элементы, ДоступныеПоляОтбора);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеИзРасшифровки(ДанныеРасшифровки)
	
	Результат = Новый Соответствие;
	
	Для Каждого ЭлементДанныхРасшифровки Из ДанныеРасшифровки.Элементы Цикл
		Если ТипЗнч(ЭлементДанныхРасшифровки) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			ЗначенияПолей = ЭлементДанныхРасшифровки.ПолучитьПоля();
			Если ЗначенияПолей.Количество() > 0 Тогда
				ЗначениеПоле = ЗначенияПолей.Найти("Значение");
				Если ЗначениеПоле <> Неопределено
					И Не ЗначениеЗаполнено(ЗначениеПоле.Значение) Тогда
					Продолжить;
				КонецЕсли;
				ЭлементДанных = Новый Структура;
				Для Каждого ЗначениеПоля Из ЗначенияПолей Цикл
					ЭлементДанных.Вставить(ЗначениеПоля.Поле, ЗначениеПоля.Значение);
				КонецЦикла;
				Если ЗначениеПоле <> Неопределено Тогда
					ЭлементДанных.Вставить("ТекущееЗначение", ЭлементДанных.Значение);
				КонецЕсли;
				Результат.Вставить(ЭлементДанныхРасшифровки.Идентификатор, ЭлементДанных);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Данные = Новый ФиксированноеСоответствие(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаписьДанных

&НаСервере
Процедура ВыполнитьЗаписьДанныхНаСервере(ВыполнятьЗаполнение)
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого ЭлементИзмененныхДанных Из ИзмененныеДанные Цикл
			ЭлементДанных = Данные.Получить(ЭлементИзмененныхДанных.Значение);
			Если ЭлементДанных <> Неопределено Тогда
				Запись = РегистрыСведений.ДоступныеЗначенияЭлементовКонструктораВидовПродукцииИС.СоздатьМенеджерЗаписи();
				Запись.ЭлементКонструктора = ЭлементДанных.ЭлементКонструктора;
				Запись.Значение = ЭлементДанных.ПараметризуемоеЗначение;
				Запись.Изменен = Истина;
				Запись.ПометкаУдаления = Не ЭлементДанных.ТекущееЗначение;
				Запись.Записать();
			КонецЕсли;
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	ИзмененныеДанные.Очистить();
	
	Если ВыполнятьЗаполнение Тогда
		ВыполнитьЗаполнениеДанныхНаСервере();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
